In [1]:
import pandas as pd
import numpy as np

In [63]:
user_info=pd.read_csv('cse.tsv',delimiter='\t',encoding='utf-8')

In [10]:
user_info=pd.read_csv('Translated_datafile40 .csv',delimiter='\t',encoding='utf-8')

In [12]:
user_info.head()

                                     ID,Text,Caption
0  3094278545_febac56382.j, একজন বউ সৈকতে তার হাত...
1   309430053_cc58bcc36a.j, নীল জলে ভাসমান একটি নৌকা
2  3094317837_b31cbf969e.j, একজন মানুষ স্রোতের উপ...
3  3094568845_d0b56c5651.j,  একটি রেস গাড়ি দর্শক...
4  3095137758_ বিড 1e613dd.j, সান্তা পোশাক পরা এক...

In [66]:
user_info.rename(columns={'ID':'token',
                          'TEXT':'english',
                          'Unnamed: 2':'bangla','Unnamed: 3':'none'
                         }, 
                 inplace=True)

In [67]:
user_info.head(10)

,token,english,bangla,none
0,1000092795.jpg#0,Two young guys with shaggy hair look at their ...,লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...,NaN
1,1000092795.jpg#1,"Two young , White males are outside near many ...",NaN,NaN
2,1000092795.jpg#2,Two men in green shirts are standing in a yard .,NaN,NaN
3,1000092795.jpg#3,A man in a blue shirt standing in a garden .,NaN,NaN
4,1000092795.jpg#4,Two friends enjoy time spent together .,দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।,NaN
5,10002456.jpg#0,Several men in hard hats are operating a giant...,NaN,NaN
6,10002456.jpg#1,Workers look down from up above on a piece of ...,NaN,NaN
7,10002456.jpg#2,Two men working on a machine wearing hard hats .,NaN,NaN
8,10002456.jpg#3,Four men on top of a tall structure .,NaN,NaN
9,10002456.jpg#4,Three men on a large rig .,NaN,NaN

In [91]:
df1=user_info['english']

In [92]:
df2=user_info['bangla']

In [94]:
df1.head()

0    Two young guys with shaggy hair look at their ...
1    Two young , White males are outside near many ...
2     Two men in green shirts are standing in a yard .
3         A man in a blue shirt standing in a garden .
4              Two friends enjoy time spent together .
Name: english, dtype: object

In [69]:
int(df[1][1:-6])

92795

In [79]:
li=[]
for i in df:
    k= i[ :-6]
    p = int(k)
    li.append(p)
    if "." in k:
        print(k)

In [123]:
df3 = pd.DataFrame(np.array(li).reshape(len(li),1))

In [124]:
df3.columns = ['token']

In [125]:
df3.head()

        token
0  1000092795
1  1000092795
2  1000092795
3  1000092795
4  1000092795

In [126]:
df=pd.concat([df3, df1,df2], axis=1)

In [127]:
df.head()

,token,english,bangla
0,1000092795,Two young guys with shaggy hair look at their ...,লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1,1000092795,"Two young , White males are outside near many ...",NaN
2,1000092795,Two men in green shirts are standing in a yard .,NaN
3,1000092795,A man in a blue shirt standing in a garden .,NaN
4,1000092795,Two friends enjoy time spent together .,দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।

In [134]:
df.head()

,token,english,bangla
0,1000092795,Two young guys with shaggy hair look at their ...,লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1,1000092795,"Two young , White males are outside near many ...",NaN
2,1000092795,Two men in green shirts are standing in a yard .,NaN
3,1000092795,A man in a blue shirt standing in a garden .,NaN
4,1000092795,Two friends enjoy time spent together .,দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।

In [132]:
final=df.sort_values(by=['token'])

In [63]:
df1=pd.read_csv('new_jumar.tsv',delimiter='\t',encoding='utf-8')

In [125]:
df1.head()

,ID,english,BN
0,2448741990.jpg#0,An ATV rider clothed in red and black protecti...,হেলমেট পরা একজন লোক গাড়ি চালিয়ে যাচ্ছে ।
1,2448793019.jpg#0,A young child wearing sunglasses is at the bas...,চশমা পরা বাচ্চা ছেলেটি নীল রঙের একটি স্লাইড এর...
2,244910130.jpg#2,A man with glasses and a beard sitting in the ...,চশমা পরা এবং দাড়িওয়ালা এক জন লোক ঘাসের ওপর বসে...
3,244910177.jpg#0,Three woman walk down a city street and one ha...,তিন জন মহিলা রাস্তা দিয়ে হেঁটে যাচ্ছে ।
4,2449289139.jpg#3,A dog running in a park .,একটি কুকুর পার্কে দৌড়াচ্ছে।

In [65]:
k=df1['ID']

In [66]:
p=df1['BN']

In [67]:
df5=pd.concat([k, p], axis=1)

In [124]:
df5.head()

               ID                                                 BN
0  1000092795.jpg  লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1  1000092795.jpg           দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।
2  1000268201.jpg                 একটি মেয়ে একটি কাঠের ভবনে যাচ্ছে।
3  1000344755.jpg  নীল শার্ট পরিহিত একটি লোক একটি মইয়ের উপর দাড়িয়...
4  1000344755.jpg  একটি লোক একটি মইয়ের উপর দাড়িয়ে উঁচু ভবনের জানা...

In [ ]:
df = pd.DataFrame(final, columns= ['token', 'english','bangla'])

In [69]:
df1=pd.read_csv('data_tuba.tsv',delimiter='\t',encoding='utf-8',names=['ID','english','BN'])

In [87]:
f= df1['ID']

In [109]:
p=f.tolist()

In [133]:
len(p)

606

In [137]:
li=[]

In [138]:
for k in range (len(p)):
    z= f[k][:-2]
    li.append(z)

In [139]:
len(li)

606

In [140]:
id = pd.DataFrame(li,columns = ['ID'])

In [141]:
id.head()

               ID
0  2448741990.jpg
1  2448793019.jpg
2   244910130.jpg
3   244910177.jpg
4  2449289139.jpg

In [142]:
t=  df1['BN']

In [143]:
df10= pd.concat([id, t], axis=1)

In [302]:
df10.head()

               ID                                                 BN
0  2448741990.jpg          হেলমেট পরা একজন লোক গাড়ি চালিয়ে যাচ্ছে ।
1  2448793019.jpg  চশমা পরা বাচ্চা ছেলেটি নীল রঙের একটি স্লাইড এর...
2   244910130.jpg  চশমা পরা এবং দাড়িওয়ালা এক জন লোক ঘাসের ওপর বসে...
3   244910177.jpg            তিন জন মহিলা রাস্তা দিয়ে হেঁটে যাচ্ছে ।
4  2449289139.jpg                        একটি কুকুর পার্কে দৌড়াচ্ছে।

In [145]:
df_row = pd.concat([df5, df10])

In [146]:
len(df_row)

2516

In [147]:
df_row.to_csv('tuba_jumar_combine_data.csv',index=False)

In [293]:
ids=df_row['ID']
ids = ids.tolist()

In [150]:
id.head()

0    1000092795.jpg
1    1000092795.jpg
2    1000268201.jpg
3    1000344755.jpg
4    1000344755.jpg
Name: ID, dtype: object

In [151]:
text=df_row['BN']

In [153]:
text.head()

0    লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1             দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে।
2                   একটি মেয়ে একটি কাঠের ভবনে যাচ্ছে।
3    নীল শার্ট পরিহিত একটি লোক একটি মইয়ের উপর দাড়িয়...
4    একটি লোক একটি মইয়ের উপর দাড়িয়ে উঁচু ভবনের জানা...
Name: BN, dtype: object

In [201]:
lt=text.tolist()

In [202]:
len(lt)

2516

In [230]:
li1=[]
for x in range (len(lt)):
    p=clean(lt[x])
    li1.append(p)

In [231]:
len(li1)

2516

In [267]:
def clean(string):
    
    value=[',','"','।','!','&','$','*','-','_','+','।']
    # To take input from the user
    # my_str = input("Enter a string: ")

    # remove punctuation from the string
    no_punct = ""
    for char in string:
        if char not in value:
            no_punct = no_punct + char

    # display the unpunctuated string
    return no_punct

In [269]:
li2=[]
for x in range (len(lt)):
    p=clean(lt[x])
    li2.append(p)

In [285]:
text = pd.DataFrame(li2,columns = ['text'])

In [286]:
text.head()

                                                text
0  লম্বা চুলের দুই তরুণ ছেলেরা উঠানে আড্ডা দেওয়া ...
1            দুই বন্ধু একসঙ্গে সময় কাটানো উপভোগ করে
2                  একটি মেয়ে একটি কাঠের ভবনে যাচ্ছে
3  নীল শার্ট পরিহিত একটি লোক একটি মইয়ের উপর দাড়িয়...
4  একটি লোক একটি মইয়ের উপর দাড়িয়ে উঁচু ভবনের জানা...

In [294]:
export = {"id": ids, "caption":li2}

dff = pd.DataFrame(export)

In [298]:
dff.to_csv("newdata.csv",index=False)